# ── Taps ─────────────────────────────────────────────────────────────────────
tap "romkatv/powerlevel10k"
tap "supabase/tap"

# ── Languages & runtimes ────────────────────────────────────────────────────
brew "python"
brew "python-tk"                          # Tk bindings for Python
brew "uv"                                 # Fast Python package manager
brew "zsh"
brew "bash"
brew "bash-completion@2"
# brew "go"
# brew "rust"
# brew "node"
# brew "deno"

# ── Shell ────────────────────────────────────────────────────────────────────
brew "romkatv/powerlevel10k/powerlevel10k"

# ── CLI tools ────────────────────────────────────────────────────────────────
brew "git"
brew "git-lfs"
brew "git-delta"                          # Beautiful git diffs
brew "gh"                                 # GitHub CLI
brew "fzf"                                # Fuzzy finder (shell integration in setup.sh)
brew "ripgrep"                            # rg — fast grep
brew "bat"                                # cat with syntax highlighting
brew "eza"                                # Modern ls replacement
brew "jq"                                 # JSON processor
brew "neovim"
brew "tmux"
brew "wget"
brew "watchexec"                          # File watcher
brew "csvkit"                             # CSV tools
brew "s3cmd"                              # S3 command-line tool
# brew "coreutils"                        # GNU core utilities
# brew "htop"
# brew "btop"
# brew "glow"                             # Markdown renderer for terminal
# brew "broot"                            # Interactive directory navigator
# brew "xsv"                              # CSV tools (Rust)

# ── Cloud & infrastructure ───────────────────────────────────────────────────
brew "supabase/tap/supabase"
# brew "awscli"
# brew "kubernetes-cli"
# brew "helm"
# brew "pulumi"
# brew "colima"

# ── Databases ────────────────────────────────────────────────────────────────
# brew "duckdb"
# brew "redis"

# ── AI / ML ──────────────────────────────────────────────────────────────────
# brew "ollama"

# ── Media ────────────────────────────────────────────────────────────────────
# brew "ffmpeg"
# brew "yt-dlp"

# ── Dev extras ───────────────────────────────────────────────────────────────
# brew "pipx"
# brew "yarn"

# ── Cask apps ────────────────────────────────────────────────────────────────

# Terminals & editors
cask "ghostty"
cask "iterm2"
cask "pulsar"
cask "jetbrains-toolbox"
# cask "visual-studio-code"
# cask "cursor"
# cask "warp"

# Browsers
cask "google-chrome"
cask "firefox"
# cask "arc"

# Communication
cask "slack"
cask "microsoft-teams"
cask "zoom"
# cask "telegram"

# Dev tools
cask "postgres-app"                       # Postgres.app
cask "tailscale-app"
# cask "docker"
# cask "tableplus"
# cask "postman"
# cask "ngrok"
# cask "cyberduck"
# cask "google-cloud-sdk"

# Productivity
cask "alfred"
cask "deckset"                            # Markdown presentations
# cask "obsidian"
# cask "bear"
# cask "joplin"
# cask "xmind"
# cask "loom"

# Creative & media
cask "spotify"
cask "inkscape"
cask "bambu-studio"                       # 3D printer slicer
# cask "figma"
# cask "blender"
# cask "vlc"
# cask "obs"
# cask "gimp"
# cask "openscad"
# cask "gifox"
# cask "gifski"
# cask "kicad"
# cask "lightburn"
# cask "autodesk-fusion"

# System utilities
cask "flux-app"
cask "appcleaner"
# cask "karabiner-elements"
# cask "caffeine"
cask "swish"
# cask "sound-control"
# cask "1blocker"
# cask "macfuse"
# cask "virtualbox"

# Hardware & maker
# cask "raspberry-pi-imager"
# cask "keymapp"                          # ZSA keyboard configurator
# cask "balenaetcher"
# cask "qmk-toolbox"

# Voice & dictation
# cask "aqua-voice"
# cask "wispr-flow"
